INSERT INTO Grp VALUES
	('А-13-18', 'ПМИ', 'ИВТИ', 'ПМ'),
	('А-05-18', 'ПМИ', 'ИВТИ', 'ПМ'),
	('А-14-18', 'ПМИ', 'ИВТИ', 'ММ')

INSERT INTO Subj VALUES
	('Базы данных', 'Экзамен'),
	('Мат. анализ', 'Экзамен'),
	('Теор. вер. и мат. стат.', 'Экзамен'),
	('Защита данных', 'Экзамен'),
	('Общая алгебра', 'Зачет с оценкой')

INSERT INTO Tchr VALUES
	('Имбирный А.М.', 'ginger@mpei.ru', '+79197264853', 5),
	('Мятный П.С.', 'mint@mpei.ru', '+79197298853', 3),
	('Яблочный С.Т.', 'apple@mpei.ru', '+79197261123', 13),
	('Кучерявобородый М.А.', 'beard@mpei.ru', '+79197919253', 2)

INSERT INTO Student VALUES
	('Сергеев А.М.', 'SergeevAM@mpei.ru', '+79872564853', 'Москва', 'Бакалавр', 0, 1),
	('Алексеев П.Т.', 'AlexeevPT@mpei.ru', '+79872192853', 'Москва', 'Бакалавр', 0, 1),
	('Иванов И.И.', 'IvanovII@mpei.ru', '+79872192853', 'Донбас', 'Бакалавр', 0, 1),
	('Петров П.П.', 'PetrovPP@mpei.ru', '+79872519253', 'Иркутск', 'Бакалавр', 0, 2),
	('Сидоров А.Н.', 'SidorovAN@mpei.ru', '+79871933253', 'Воронеж', 'Бакалавр', 0, 2),
	('Калмыков Н.Ю.', 'KalmikovNU@mpei.ru', '+79872123253', 'Нововоронеж', 'Бакалавр', 0, 2),
	('Базов Г.Ч.', 'BazovGC@mpei.ru', '+79872512353', 'Чебоксары', 'Бакалавр', 0, 3),
	('Кринжев С.К.', 'CringevSK@mpei.ru', '+79872518253', 'Новочебоксарск', 'Бакалавр', 0, 3),
	('Моцарт В.А.', 'MozartVA@mpei.ru', '+79872519212', 'Курск', 'Бакалавр', 0, 3)

INSERT INTO Grp_Subj VALUES
	(6, 1),
	(7, 1),
	(8, 1),
	(9, 1),
	(6, 2),
	(7, 2),
	(8, 2),
	(9, 2),
	(7, 3),
	(8, 3),
	(9, 3),
	(10, 3)

INSERT INTO Tchr_Subj VALUES
	(7, 1),
	(8, 2),
	(10, 2),
	(6, 3),
	(9, 4)

INSERT INTO AccAttend VALUES
	(1, 6, 3, 'Лекция', 1, '2021-9-1'),
	(2, 6, 3, 'Лекция', 1, '2021-9-1'),
	(3, 6, 3, 'Лекция', 1, '2021-9-1'),
	(1, 7, 1, 'Лекция', 1, '2021-9-1'),
	(2, 7, 1, 'Лекция', 0, '2021-9-1'),
	(3, 7, 1, 'Лекция', 0, '2021-9-1'),

	(4, 6, 3, 'Лекция', 0, '2021-9-1'),
	(5, 6, 3, 'Лекция', 0, '2021-9-1'),
	(6, 6, 3, 'Лекция', 1, '2021-9-1'),
	(4, 7, 1, 'Лекция', 1, '2021-9-1'),
	(5, 7, 1, 'Лекция', 1, '2021-9-1'),
	(6, 7, 1, 'Лекция', 0, '2021-9-1'),

	(7, 10, 2, 'Лекция', 1, '2021-9-2'),
	(8, 10, 2, 'Лекция', 0, '2021-9-2'),
	(9, 10, 2, 'Лекция', 1, '2021-9-2'),
	(7, 8, 2, 'Лекция', 1, '2021-9-2'),
	(8, 8, 2, 'Лекция', 0, '2021-9-2'),
	(9, 8, 2, 'Лекция', 1, '2021-9-2')

INSERT INTO AccMarks VALUES
	(1, 6, 3, 5, 2),
	(2, 6, 3, 4, 2),
	(3, 6, 3, 5, 2),
	(1, 7, 1, 3, 2),
	(2, 7, 1, 5, 2),
	(3, 7, 1, 4, 2),

	(4, 6, 3, 4, 2),
	(5, 6, 3, 5, 2),
	(6, 6, 3, 4, 2),
	(4, 7, 1, 3, 2),
	(5, 7, 1, 4, 2),
	(6, 7, 1, 3, 2),

	(7, 10, 2, 5, 2),
	(8, 10, 2, 4, 2),
	(9, 10, 2, 4, 2),
	(7, 8, 2, 3, 2),
	(8, 8, 2, 5, 2),
	(9, 8, 2, 4, 2)

INSERT INTO KM VALUES
	(2, 'КМ 1', 5),
	(2, 'КМ 2', 4),

	(3, 'КМ 1', 2),
	(3, 'КМ 2', 3),

	(4, 'КМ 1', 3),
	(4, 'КМ 2', 4),

	(5, 'КМ 1', 3),
	(5, 'КМ 2', 5),

	(6, 'КМ 1', 5),
	(6, 'КМ 2', 5),

	(7, 'КМ 1', 4),
	(7, 'КМ 2', 4),

	(8, 'КМ 1', 3),
	(8, 'КМ 2', 3),
	(8, 'КМ 3', 2),
	(8, 'КМ 4', 2),

	(9, 'КМ 1', 3),
	(9, 'КМ 2', 2),

	(10, 'КМ 1', 5),
	(10, 'КМ 2', 3),

	(11, 'КМ 1', 3),
	(11, 'КМ 2', 4),

	(12, 'КМ 1', 2),
	(12, 'КМ 2', 2),

	(13, 'КМ 1', 3),
	(13, 'КМ 2', 4),

	(14, 'КМ 1', 3),
	(14, 'КМ 2', 4),

	(15, 'КМ 1', 4),
	(15, 'КМ 2', 3),

	(16, 'КМ 1', 5),
	(16, 'КМ 2', 2),

	(17, 'КМ 1', 4),
	(17, 'КМ 2', 5),

	(18, 'КМ 1', 3),
	(18, 'КМ 2', 2),

	(19, 'КМ 1', 5),
	(19, 'КМ 2', 3)


INSERT INTO Work VALUES
	(59, 'Практика 1', 'Практ', 1, 5),
	(60, 'КР 1', 'КР', 1, 4),
	(61, 'ЛР 1', 'ЛР', 0, 2),
	(63, 'КР 1', 'КР', 1, 3),
	(66, 'ТР 1', 'ТР', 1, 5),
	(70, 'Практика 1', 'Практ', 1, 5),
	(74, 'Практика 1', 'Практ', 0, 2),
	(82, 'КР 1', 'КР', 1, 5),
	(77, 'ЛР 1', 'ЛР', 1, 3),
	(80, 'Практика 1', 'Практ', 0, 2),
	(87, 'КР 1', 'КР', 1, 5),
	(84, 'ЛР 1', 'ЛР', 1, 4),
	(88, 'Практика 1', 'Практ', 0, 2),
	(93, 'ТР 1', 'ТР', 1, 4)



